robotix-iran/ArduinoCore-robotix/boards.txt
##############################################################

innobot.name=Robotix InnoBot
innobot.build.core=arduino
innobot.build.crossprefix=arm-none-eabi-
innobot.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

innobot.build.variant=innobot
innobot.build.mcu=cortex-m4
innobot.build.architecture=cortex-m4
innobot.build.fpu=-mfpu=fpv4-sp-d16
innobot.build.float-abi=-mfloat-abi=hard

innobot.build.board=innobot
innobot.build.defines=-DF_CPU=48000000 -DNO_USB -DBACKTRACE_SUPPORT -DROBOTIX_INNOBOT -DARDUINO_UNOR4_WIFI
innobot.vid.0=0x2342
innobot.pid.0=0x1000
innobot.vid.1=0x2342
innobot.pid.1=0x0060
innobot.upload_port.0.vid=0x2342
innobot.upload_port.0.pid=0x1000
innobot.upload_port.1.vid=0x2342
innobot.upload_port.1.pid=0x0060

innobot.compiler.fsp.defines={build.variant.path}/defines.txt
innobot.compiler.fsp.ldflags={build.variant.path}/ldflags.txt
innobot.compiler.fsp.cflags=-mthumb "@{compiler.fsp.defines}"
innobot.compiler.fsp.cxxflags=-mthumb "@{compiler.fsp.defines}"
innobot.compiler.tinyusb.cflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
innobot.compiler.tinyusb.cxxflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
innobot.compiler.fsp.includes={build.variant.path}/includes.txt
innobot.compiler.fsp.extra_ldflags=--specs=nano.specs -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
innobot.compiler.fsp="{build.variant.path}/libs/libfsp.a"

innobot.upload.tool=bossac
innobot.upload.tool.default=bossac
innobot.upload.protocol=sam-ba
innobot.upload.transport=
innobot.upload.vid=0x2342
innobot.upload.pid=0x1000
innobot.upload.use_1200bps_touch=true
innobot.upload.wait_for_upload_port=false
innobot.upload.native_usb=true
innobot.upload.maximum_size=262144
innobot.upload.maximum_data_size=32768

innobot.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
innobot.debug.server.openocd.scripts.1={programmer.transport_script}
innobot.debug.server.openocd.scripts.2={runtime.platform.path}/debugger/R7FA4M1AB.cfg
innobot.debug.svd_file={runtime.platform.path}/svd/R7FA4M1AB.svd

##############################################################